package com.jymj.zhglxt.rjhj.bean.enums;

/**
 * Created by ${lc} on 2020/11/25.环境整治三级分类
 */
public enum HjzzsjEnum {
    /*
    seven("垃圾收集设施存在满冒、渗漏、污迹或破损", 1032),
    eight("垃圾收集设施周边管护不到位", 1033),
    ten("地搓站", 1034),
    eighteen("生活垃圾", 1052),
    eighteens("建筑垃圾", 1054),
    twentythrees("便槽蹲位污垢、地面脏污、粪池满溢", 1111),
    twentythreed("无制度上墙", 1112),
    twentynine("存量侵街占道私搭乱建", 1142),
    thirty("新增侵街占道私搭乱建的", 1143),*/

    /*twoi("村内暂无问题", 1014),
    woa("村庄整体环境小问题", 1021),
    twob("12345舆情", 1022),
    seven("垃圾设施满冒", 1031),
    sevena("垃圾设施渗漏、污迹", 1032),
    sevenb("垃圾设施破损", 1033),
    eight("垃圾设施周边管护不到位", 1034),
    ten("地搓站", 1035),
    eighteena("垃圾分类执行", 1051),
    eighteen("积存生活垃圾", 1052),
    eighteens("建筑垃圾", 1054),
    eighteenb("路边及周边乱倒乱扔垃圾", 1061),
    eighteensa("污水直排", 1071),
    eighteensb("黑臭水体", 1081),
    eighteensc("排水沟堵塞、积存垃圾", 1082),
    twentyninea("乱堆乱放", 1121),
    twentynineb("乱贴乱画乱挂", 1131),
    twentynine("存量私搭乱建", 1142),
    thirty("新增私搭乱建", 1143),
    twentythreedb("旱厕", 1144),

    twentythreesa("公厕未正常开放", 3091),
    twentythreesh("公厕正常开放", 3092),
    twentythreesb("公厕上下水设施损坏", 3101),
    twentythreesc("公厕座便、蹲位设施损坏", 3102),
    twentythreesd("公厕洗手池设施损坏", 3103),
    twentythreesg("公厕便槽蹲位脏污", 3111),
    twentythreese("公厕地面脏污", 3112),
    twentythreesf("公厕粪池满溢", 3113),
    twentythreeg("无制度", 3114),
    twentythreeda("制度未上墙", 3115),
    twentythreedc("有消毒记录", 3116),
    twentythreedd("无消毒记录", 3117),
    forty ("无管护制度", 2032),
    fortytwo ("制度没有张贴上墙", 2034),
    fortysisx ("未提供安全巡检记录", 2061),
    fortysixs ("无安全警示标识", 2062),
    fortysixn ("无防滑措施", 2063),
    *//*fiftythree ("缺少管护制度", 3011),
    fiftyfour ("未建立健全户厕台账", 3012),
    fiftyseven ("无专业清掏队伍", 3021),
    fiftyeight("无清掏记录、设备巡检记录、维修记录", 3022),
    sixtytwo ("无专业清掏运输车辆设备", 3031),
    sixtyfour ("清掏、运输过程中有遗漏、有遗撒", 3032),
    sixtysix ("无固定的粪污规范 处理设施或处理站点", 3033),
    sixtyseven ("三格化粪池：清掏不及时", 3041),
    sixtyeight ("小型一体化粪污处理设施,未能在规定时间内解决问题的", 3042),*//*
    seventyone("无绿化管护制度和养护标准", 4011),
    seventythree ("无绿化台账", 4012),
    ninety ("未提供巡检、维修记录", 5062),
    ninetytwo ("单灯故障超过72小时，照明系统性故障超过48小时,存在维修不及时", 5064),

    twoi1("村内暂无问题", 6014),
    twoa1("村庄整体环境小问题", 6021),
    twob1("12345舆情", 6022),
    seven1("垃圾设施满冒", 6031),
    sevena1("垃圾设施渗漏、污迹", 6032),
    sevenb1("垃圾设施破损", 6033),
    eight1("垃圾设施周边管护不到位", 6034),
    ten1("地搓站", 6035),
    eighteena1("垃圾分类执行", 6051),
    eighteen1("积存生活垃圾", 6052),
    eighteens1("建筑垃圾", 6054),
    eighteenb1("路边及周边乱倒扔垃圾", 6061),
    eighteensa1("污水直排", 6071),
    eighteensb1("黑臭水体", 6081),
    eighteensc1("排水沟堵塞、积存垃圾", 6082),
    twentyninea1("乱堆乱放", 6121),
    twentynineb1("乱贴乱画乱挂", 6131),
    twentynine1("存量私搭乱建", 6142),
    thirty1("新增私搭乱建", 6143),
    twentythreedb1("旱厕", 6144),
    twentythreesa1("公厕未正常开放", 6091),
    twentythreesh1("公厕正常开放", 6092),
    twentythreesb1("公厕上下水设施损坏", 6101),
    twentythreesc1("公厕座便、蹲位设施损坏", 6102),
    twentythreesd1("公厕洗手池设施损坏", 6103),
    twentythreesg1("公厕便槽蹲位脏污", 6111),
    twentythreese1("公厕地面脏污", 6112),
    twentythreesf1("公厕粪池满溢", 6113),
    twentythreeg1("无制度", 6114),
    twentythreeda1("制度未上墙", 6115),
    twentythreedc1("有消毒记录", 6116),
    twentythreedd1("无消毒记录", 6117),


    twoi2("村内暂无问题", 7014),
    twoa2("村庄整体环境小问题", 7021),
    twob2("12345舆情", 7022),
    seven2("垃圾设施满冒", 7031),
    sevena2("垃圾设施渗漏、污迹", 7032),
    sevenb2("垃圾设施破损", 7033),
    eight2("垃圾设施周边管护不到位", 7034),
    ten2("地搓站", 7035),
    eighteena2("垃圾分类执行", 7051),
    eighteen2("积存生活垃圾", 7052),
    eighteens2("建筑垃圾", 7054),
    eighteenb2("路边及周边乱倒扔垃圾", 7061),
    eighteensa2("污水直排", 7071),
    eighteensb2("黑臭水体", 7081),
    eighteensc2("排水沟堵塞、积存垃圾", 7082),
    twentyninea2("乱堆乱放", 7121),
    twentynineb2("乱贴乱画乱挂", 7131),
    twentynine2("存量私搭乱建", 7142),
    thirty2("新增私搭乱建", 7143),
    twentythreedb2("旱厕", 7144);
    ;*/
    /*one("垃圾收集设施存在满冒、渗漏、污渍、破损或周边管护不到位问题", 1002),
    two("垃圾分类示范村未配置垃圾分类桶站和容器标识", 1003),
    three("暴露垃圾和积存生活垃圾（突出问题）", 1004),
    twoa("建筑垃圾", 1005),
    four("村内街坊路路面（含农村集市）存在清扫保洁不到位、垃圾乱倒乱扔、卫生死角盲区", 1006),
    five("生活污水直排溢流路面、乱排乱放问题", 1007),
    six("未经处理的生活污水直接排入河塘沟渠现象", 1008),
    seven("沟渠有垃圾、杂物淤积堵塞影响排水", 1009),
    eight("有明显黑臭水体", 1010),
    nine("侵街占道私搭乱建", 1011),
    ten("乱堆乱放", 1012),
    eleven("街坊路严重破损失修", 1013),
    twelve("街坊路坑洼积水现象", 1014),
    thirteen("公共绿化枯死、破坏、占绿毁绿", 1015),
    fourteen("违规广告和残损破旧牌匾标识、乱贴乱画乱挂", 1016),
    fifteen("村内架空线杂乱无序交织，存在安全隐患", 1017),
    sixteen("路灯损毁、养护不到位", 1018),
    seventeen("路灯不亮现象", 1019),
    eighteen("田园堆放农药化肥包装物、废旧农膜等农业投入品废弃物", 1020),
    nineteen("田园烧荒现象", 1021),
    ///////------------------------------------------------------------------------------------
    forty ("无管护制度", 2032),
    fortytwo ("制度没有张贴上墙", 2034),
    fortysisx ("未提供安全巡检记录", 2061),
    fortysixs ("无安全警示标识", 2062),
    fortysixn ("无防滑措施", 2063),
    ///////------------------------------------------------------------------------------------
    zero3("公厕未按规定正常开放（公厕因在建、维修等合理原因未开放除外）", 3022),
    one3("公厕上下水、座便蹲位、洗手池等设施损坏不能正常使用", 3023),
    two3("制度未上墙", 3024),
    three3("公厕存在厕位有污物、脏臭（异味）等问题", 3025),
    four3("存在三类（不含）以下公厕的（旱公厕）", 3026),
    five3("存在非无害化户厕的（旱户厕）", 3027),

    //zero("当月12345热线和上级部门反映相关问题未解决或解决不满意", 1001),
    one6("垃圾收集设施存在满冒、渗漏、污渍、破损或周边管护不到位问题", 6002),
    two6("垃圾分类示范村未配置垃圾分类桶站和容器标识", 6003),
    three6("暴露垃圾和积存生活垃圾（突出问题）", 6004),
    twoa6("建筑垃圾", 6005),
    four6("村内街坊路路面（含农村集市）存在清扫保洁不到位、垃圾乱倒乱扔、卫生死角盲区", 6006),
    five6("生活污水直排溢流路面、乱排乱放问题", 6007),
    six6("未经处理的生活污水直接排入河塘沟渠现象", 6008),
    seven6("沟渠有垃圾、杂物淤积堵塞影响排水", 6009),
    eight6("有明显黑臭水体", 6010),
    nine6("侵街占道私搭乱建", 6011),
    ten6("乱堆乱放", 6012),
    eleven6("街坊路严重破损失修", 6013),
    twelve6("街坊路坑洼积水现象", 6014),
    thirteen6("公共绿化枯死、破坏、占绿毁绿", 6015),
    fourteen6("违规广告和残损破旧牌匾标识、乱贴乱画乱挂", 6016),
    fifteen6("村内架空线杂乱无序交织，存在安全隐患", 6017),
    sixteen6("路灯损毁、养护不到位", 6018),
    seventeen6("路灯不亮现象", 6019),
    eighteen6("田园堆放农药化肥包装物、废旧农膜等农业投入品废弃物", 6020),
    nineteen6("田园烧荒现象", 6021),
    twenty6("公厕未按规定正常开放（公厕因在建、维修等合理原因未开放除外）", 6022),
    twentyone6("公厕上下水、座便蹲位、洗手池等设施损坏不能正常使用", 6023),
    twentytwo6("制度未上墙", 6024),
    twentythree6("公厕存在厕位有污物、脏臭（异味）等问题", 6025),
    twentytwoa6("存在三类（不含）以下公厕的（旱公厕）", 6026),
    twentyfour6("存在非无害化户厕的（旱户厕）", 6027),

    //zero7("当月12345热线和上级部门反映相关问题未解决或解决不满意", 7001),
    one7("垃圾收集设施存在满冒、渗漏、污渍、破损或周边管护不到位问题", 7002),
    two7("垃圾分类示范村未配置垃圾分类桶站和容器标识", 7003),
    three7("暴露垃圾和积存生活垃圾（突出问题）", 7004),
    twoa7("建筑垃圾", 7005),
    four7("村内街坊路路面（含农村集市）存在清扫保洁不到位、垃圾乱倒乱扔、卫生死角盲区", 7006),
    five7("生活污水直排溢流路面、乱排乱放问题", 7007),
    six7("未经处理的生活污水直接排入河塘沟渠现象", 7008),
    seven7("沟渠有垃圾、杂物淤积堵塞影响排水", 7009),
    eight7("有明显黑臭水体", 7010),
    nine7("侵街占道私搭乱建", 7011),
    ten7("乱堆乱放", 7012),
    eleven7("街坊路严重破损失修", 7013),
    twelve7("街坊路坑洼积水现象", 7014),
    thirteen7("公共绿化枯死、破坏、占绿毁绿", 7015),
    fourteen7("违规广告和残损破旧牌匾标识、乱贴乱画乱挂", 7016),
    fifteen7("村内架空线杂乱无序交织，存在安全隐患", 7017),
    sixteen7("路灯损毁、养护不到位", 7018),
    seventeen7("路灯不亮现象", 7019),
    eighteen7("田园堆放农药化肥包装物、废旧农膜等农业投入品废弃物", 7020),
    nineteen7("田园烧荒现象", 7021);*/
    onec("垃圾收集设施存在满冒、渗漏、污渍、破损", 1150),
    onec1("圾收集设施周边管护不到位问题", 1151),
    twoc("垃圾分类示范村未配置垃圾分类桶站和容器标识", 1152),
    threec("暴露垃圾和积存生活垃圾", 1153),
    twoac("建筑垃圾", 1154),
    fourc("村内街坊路路面（含农村集市）存在清扫保洁不到位、垃圾乱倒乱扔、卫生死角盲区", 1155),
    fivec("生活污水直排溢流路面、乱排乱放问题", 1156),
    sixc("未经处理的生活污水直接排入河塘沟渠现象", 1157),
    sevenc("沟渠有垃圾、杂物淤积堵塞影响排水", 1158),
    eightc("有明显黑臭水体", 1159),
    ninec("侵街占道私搭乱建", 1160),
    tenc("乱堆乱放", 1161),
    elevenc("街坊路严重破损失修", 1162),
    twelvec("街坊路坑洼积水现象", 1163),
    thirteenc("公共绿化枯死、破坏、占绿毁绿", 1164),
    fourteenc("违规广告和残损破旧牌匾标识、乱贴乱画乱挂", 1165),
    fifteenc("村内架空线杂乱无序交织，存在安全隐患", 1166),
    sixteenc("路灯损毁、养护不到位", 1167),
    seventeenc("路灯不亮现象", 1168),
    eighteenc("田园堆放农药化肥包装物、废旧农膜等农业投入品废弃物", 1169),
    nineteenc("田园烧荒现象", 1170),
    four3("存在三类（不含）以下公厕的（旱公厕）", 1171),
    five3("存在非无害化户厕的（旱户厕）", 1172),
    //*************************************
    /*twoi("村内暂无问题", 1014),
    twoa("村庄整体环境小问题", 1021),
    twob("12345舆情", 1022),
    seven("垃圾设施满冒", 1031),
    sevena("垃圾设施渗漏、污迹", 1032),
    sevenb("垃圾设施破损", 1033),
    eight("垃圾设施周边管护不到位", 1034),
    ten("地搓站", 1035),
    eighteena("垃圾分类执行", 1051),
    eighteen("积存生活垃圾", 1052),
    eighteens("建筑垃圾", 1054),
    eighteenb("路边及周边乱倒扔垃圾", 1061),
    eighteensa("污水直排", 1071),
    eighteensb("黑臭水体", 1081),
    eighteensc("排水沟堵塞、积存垃圾", 1082),
    twentyninea("乱堆乱放", 1121),
    twentynineb("乱贴乱画乱挂", 1131),
    twentynine("存量私搭乱建", 1142),
    thirty("新增私搭乱建", 1143),
    twentythreedb("旱厕", 1144),*/

    six3("公厕正常开放", 3092),
    zero3("公厕未按规定正常开放（公厕因在建、维修等合理原因未开放除外）", 3150),
    foura3("公厕在建、维修：此处需外业拍照上传门前说明", 3151),
    one3("公厕上下水、座便蹲位、洗手池等设施损坏不能正常使用", 3152),
    two3("制度未上墙", 3153),
    three3("公厕存在厕位有污物、脏臭（异味）等问题", 3154),
    /*four3("存在三类（不含）以下公厕的（旱公厕）", 3155),
    five3("存在非无害化户厕的（旱户厕）", 3156),*/
    ///******************************************
    /*twentythreesa("公厕未正常开放", 3091),
    twentythreesh("公厕正常开放", 3092),
    twentythreesb("公厕上下水设施损坏", 3101),
    twentythreesc("公厕座便、蹲位设施损坏", 3102),
    twentythreesd("公厕洗手池设施损坏", 3103),
    twentythreesg("公厕便槽蹲位脏污", 3111),
    twentythreese("公厕地面脏污", 3112),
    twentythreesf("公厕粪池满溢", 3113),
    twentythreeg("无制度", 3114),
    twentythreeda("制度未上墙", 3115),
    twentythreedc("有消毒记录", 3116),
    twentythreedd("无消毒记录", 3117),*/

    oned("垃圾收集设施存在满冒、渗漏、污渍、破损", 6150),
    oned1("圾收集设施周边管护不到位问题", 6151),
    twod("垃圾分类示范村未配置垃圾分类桶站和容器标识", 6152),
    threed("暴露垃圾和积存生活垃圾", 6153),
    twoad("建筑垃圾", 6154),
    fourd("村内街坊路路面（含农村集市）存在清扫保洁不到位、垃圾乱倒乱扔、卫生死角盲区", 6155),
    fived("生活污水直排溢流路面、乱排乱放问题", 6156),
    sixd("未经处理的生活污水直接排入河塘沟渠现象", 6157),
    sevend("沟渠有垃圾、杂物淤积堵塞影响排水", 6158),
    eightd("有明显黑臭水体", 6159),
    nined("侵街占道私搭乱建", 6160),
    tend("乱堆乱放", 6161),
    elevend("街坊路严重破损失修", 6162),
    twelved("街坊路坑洼积水现象", 6163),
    thirteend("公共绿化枯死、破坏、占绿毁绿", 6164),
    fourteend("违规广告和残损破旧牌匾标识、乱贴乱画乱挂", 6165),
    fifteend("村内架空线杂乱无序交织，存在安全隐患", 6166),
    sixteend("路灯损毁、养护不到位", 6167),
    seventeend("路灯不亮现象", 6168),
    eighteend("田园堆放农药化肥包装物、废旧农膜等农业投入品废弃物", 6169),
    nineteend("田园烧荒现象", 6170),
    four6("存在三类（不含）以下公厕的（旱公厕）", 6171),
    five6("存在非无害化户厕的（旱户厕）", 6172),

    six6("公厕正常开放", 6092),
    zero6("公厕未按规定正常开放", 6650),
    foura6("公厕在建、维修：此处需外业拍照上传门前说明", 6651),
    one6("公厕上下水、座便蹲位、洗手池等设施损坏不能正常使用", 6652),
    two6("制度未上墙", 6653),
    three6("公厕存在厕位有污物、脏臭（异味）等问题", 6654),
    /*four6("存在三类（不含）以下公厕的（旱公厕）", 6155),
    five6("存在非无害化户厕的（旱户厕）", 6156),*/
    //**************************************************
   /* twoi1("村内暂无问题", 6014),
    twoa1("村庄整体环境小问题", 6021),
    twob1("12345舆情", 6022),
    seven1("垃圾设施满冒", 6031),
    sevena1("垃圾设施渗漏、污迹", 6032),
    sevenb1("垃圾设施破损", 6033),
    eight1("垃圾设施周边管护不到位", 6034),
    ten1("地搓站", 6035),
    eighteena1("垃圾分类执行", 6051),
    eighteen1("积存生活垃圾", 6052),
    eighteens1("建筑垃圾", 6054),
    eighteenb1("路边及周边乱倒扔垃圾", 6061),
    eighteensa1("污水直排", 6071),
    eighteensb1("黑臭水体", 6081),
    eighteensc1("排水沟堵塞、积存垃圾", 6082),
    twentyninea1("乱堆乱放", 6121),
    twentynineb1("乱贴乱画乱挂", 6131),
    twentynine1("存量私搭乱建", 6142),
    thirty1("新增私搭乱建", 6143),
    twentythreedb1("旱厕", 6144),


    twentythreesa1("公厕未正常开放", 6091),
    twentythreesh1("公厕正常开放", 6092),
    twentythreesb1("公厕上下水设施损坏", 6101),
    twentythreesc1("公厕座便、蹲位设施损坏", 6102),
    twentythreesd1("公厕洗手池设施损坏", 6103),
    twentythreesg1("公厕便槽蹲位脏污", 6111),
    twentythreese1("公厕地面脏污", 6112),
    twentythreesf1("公厕粪池满溢", 6113),
    twentythreeg1("无制度", 6114),
    twentythreeda1("制度未上墙", 6115),
    twentythreedc1("有消毒记录", 6116),
    twentythreedd1("无消毒记录", 6117),*/



    onee("垃圾收集设施存在满冒、渗漏、污渍、破损", 7150),
    onee1("圾收集设施周边管护不到位问题", 7151),
    twoe("垃圾分类示范村未配置垃圾分类桶站和容器标识", 7152),
    threee("暴露垃圾和积存生活垃圾", 7153),
    twoae("建筑垃圾", 7154),
    foure("村内街坊路路面（含农村集市）存在清扫保洁不到位、垃圾乱倒乱扔、卫生死角盲区", 7155),
    fivee("生活污水直排溢流路面、乱排乱放问题", 7156),
    sixe("未经处理的生活污水直接排入河塘沟渠现象", 7157),
    sevene("沟渠有垃圾、杂物淤积堵塞影响排水", 7158),
    eighte("有明显黑臭水体", 7159),
    ninee("侵街占道私搭乱建", 7160),
    tene("乱堆乱放", 7161),
    elevene("街坊路严重破损失修", 7162),
    twelvee("街坊路坑洼积水现象", 7163),
    thirteene("公共绿化枯死、破坏、占绿毁绿", 7164),
    fourteene("违规广告和残损破旧牌匾标识、乱贴乱画乱挂", 7165),
    fifteene("村内架空线杂乱无序交织，存在安全隐患", 7166),
    sixteene("路灯损毁、养护不到位", 7167),
    seventeene("路灯不亮现象", 7168),
    eighteene("田园堆放农药化肥包装物、废旧农膜等农业投入品废弃物", 7169),
    nineteene("田园烧荒现象", 7170),
    four7("存在三类（不含）以下公厕的（旱公厕）", 7171),
    five7("存在非无害化户厕的（旱户厕）", 7172),
    //****************************
    /*twoi2("村内暂无问题", 7014),
    twoa2("村庄整体环境小问题", 7021),
    twob2("12345舆情", 7022),
    seven2("垃圾设施满冒", 7031),
    sevena2("垃圾设施渗漏、污迹", 7032),
    sevenb2("垃圾设施破损", 7033),
    eight2("垃圾设施周边管护不到位", 7034),
    ten2("地搓站", 7035),
    eighteena2("垃圾分类执行", 7051),
    eighteen2("积存生活垃圾", 7052),
    eighteens2("建筑垃圾", 7054),
    eighteenb2("路边及周边乱倒扔垃圾", 7061),
    eighteensa2("污水直排", 7071),
    eighteensb2("黑臭水体", 7081),
    eighteensc2("排水沟堵塞、积存垃圾", 7082),
    twentyninea2("乱堆乱放", 7121),
    twentynineb2("乱贴乱画乱挂", 7131),
    twentynine2("存量私搭乱建", 7142),
    thirty2("新增私搭乱建", 7143),
    twentythreedb2("旱厕", 7144)*/;



    private String name;
    private int index;

    // 构造方法
    private HjzzsjEnum(String name, int index) {
        this.name = name;
        this.index = index;
    }

    /*// 普通方法
    public static String getName(int index) {
        for (HjzzsjEnum s : HjzzsjEnum.values()) {
            if (s.getIndex() == index) {
                return s.name;
            }
        }
        return null;
    }*/
    public static Integer getIndex(String name) {
        for (HjzzsjEnum s : HjzzsjEnum.values()) {
            if (s.getName() .equals(name)) {
                return s.index;
            }
        }
        return -1;
    }
    // 普通方法
    public static Integer getIndex(String name, Integer index) {
        for (HjzzsjEnum s : HjzzsjEnum.values()) {
            String inde = s.getIndex()+"";
            String substring = inde.substring(0, 3);
            if (s.getName().equals(name)&&inde.equals(index.toString())) {
                return s.index;
            }
        }
        return -1;
    }
    // 普通方法
    public static String getName(int index) {
        if (index==-1){
            return "";
        }
        for (HjzzsjEnum s : HjzzsjEnum.values()) {
            if (s.getIndex() == index) {
                return s.name;
            }
        }
        return "";
    }
    // get set 方法
    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }

    public int getIndex() {
        return index;
    }

    public void setIndex(int index) {
        this.index = index;
    }
}
