package com.jymj.zhglxt.zjd.bean;

/**
 * Created by ${lc} on 2020/11/16.环境整治一级分类
 */

public enum TdlyTextEnum {
    zero("耕地", "指经过开垦用以种植农作物并经常进行耕种的田地。包括种有作物的土地面积、休闲地、新开荒地和抛荒未满3年的土地面积。",0),
    one("园地", "指成片种植果树、桑树、茶树的土地。",0),
    two("林地", "指生长乔木、竹类、灌木、沿海红树林等种植林木的土地。",0),
    two1("设施农业用地", "指对地表耕作层造成破坏的，为农业生产、农村生活服务的乡村道路用地以及种植设施、畜禽养殖设施、水产养殖设施建设用地，不包括村庄内部道路用地。",0),
    two2("其他农用地", "指除耕地、园地、林地之外的农业用途的面积，如工厂化作物栽培的生产设施用地及其相应附属用地，农村宅基地以外的养殖畜禽场地、晒谷场等农业设施用地。",0),
    two3("居住用地", "指农村用于生活居住的土地。",0),
    two4("公共管理与公共服务用地", "指用于村委会办公室、医疗、教育、卫生等公益事业和公共设施用地。",0),
    two5("集体经营性建设用地", "农村集体经济组织使用乡（镇）土地利用总体规划确定的建设用地兴办企业或者与其他单位、个人以土地使用权入股、联营等形式共同举办企业所使用的农村集体建设用地，如过去的乡镇企业用地。",0),
    two6("征地时间", "一般按年度填写，如有需要，可具体到月。",0),
    two7("公益性征地", "包括（1）军事和外交需要用地的；（2）由政府组织实施的能源、交通、水利、通信、邮政等基础设施建设需要用地的；（3）由政府组织实施的科技、教育、文化、卫生、体育、生态环境和资源保护、防灾减灾、文物保护、社区综合服务、社会福利、市政公用、优抚安置、英烈保护等公共事业需要用地的；（4）由政府组织实施的扶贫搬迁、保障性安居工程建设需要用地的。",0),
    two8("开发建设征地", "在土地利用总体规划确定的城镇建设用地范围内，经省级以上人民政府批准由县级以上地方人民政府组织实施的成片开发建设需要用地的。",0),
    two9("其他征地", "除公益性征地、开发建设征地外，法律规定为公共利益需要可以征收农民集体所有的土地的其他情形。填写中需注明具体用途。",0),
    two10("征地补偿费", "包括土地补偿费、安置补助费、青苗补偿和其他地上附着物补偿等补偿费用总额。",0),
    two11("占地时间", "一般按年度填写，如有需要，可具体到月。",0),
    two12("第二产业", "二产业包括工业和建筑业。",0),
    two13("生产性服务", "生产性服务主要包括交通运输业、现代物流业、金融服务业、信息服务业、高技术服务业和商务服务业等重要行业和部门。",0),
    two14("生活性服务", "生活性服务主要包括餐饮业、住宿业、家政服务业、洗染业、美发美容业、沐浴业、人像摄影业、维修服务业和再生资源回收业等服务业态。",0),
    two15("公有经济", "公有经济中不包括国有经济。",0),
    two16("村集体企业收入", "集体企业包括村集体控股企业或村集体领办并控股的农民合作社，参股的填写参股部分收入。村组织与村集体企业收入不能重合。",0),
    two17("私营企业收入", "私营企业含民专业合作社等。",0),
    two18("收入", "收入一般指村内集体经济组织、专业合作社、家庭农场、农户等经济主体进行生产、服务等各种经营活动实现的经营收入。自产留用的种子、饲料、工业用原材料视同收入，也在此监测。",0),
    two19("第三产业", "第三产业包括交通运输、仓储及邮政业、批发与零售业、住宿和餐饮业、居民服务、修理和其他服务业。",0),
    two20("文化程度", "1=小学及以下；2=初中；3=高中（中专）；4=本科及以上（含大专）。",0),
    two21("村集体企业收入", "集体企业包括村集体控股企业或村集体领办并控股的农民合作社，参股的填写参股部分收入。村集体经济组织与村集体企业收入不能重合。",0),
    two22("私营企业", "私营企业含民专业合作社等。",0),
    two23("主营业务收入", "指村级集体经济组织本年度进行各项生产、服务等经营活动实现的经营收入，包括房地产开发收入。",0),
    two24("其他业务收入（地、山、林、房等出租）", "指村级集体经济组织主营业务以外的其他业务收入。如收缴资金占用费、租金，销售物资、出租固定资产等取得的收入及服务性收费等。",0),
    two25("投资收益（利息、股权收益等）", "指村级集体经济组织对外投资分得的利润和利息。包括对外投资分得的利润、股利、债券利息以及投资到期收回或者中途转让取得的净收益。",0),
    two26("补贴收入", "指村级集体经济组织得到的各项补贴收入。",0),
    two27("营业外收入", "指村级集体经济组织经营业务以外的收入，包括固定资产盘盈、处理固定资产净收益等。",0),
    two28("村干部补贴", "不含财政发放的工资收入。",0),
    two29("村级组织办公经费", "主要指必要的办公用品费、报刊费、办公场所水电费和通讯费、会议活动费等维持村级组织正常运转所必须的开支。",0),
    two30("公共服务运行维护费", "包括村内治安、公共卫生防疫、公共服务设施维护等支出。",0),
    two31("村级负担的其他水电费", "主要指村集体经济组织实际承担的、本应由村民负担的水电费。",0),

    ;

    // 成员变量
    private String name;
    private String index;

    // 构造方法
    private TdlyTextEnum(String name, String index) {
        this.name = name;
        this.index = index;
    }
    // 构造方法
    private TdlyTextEnum(String index, String name, int inst) {
        this.index = index;
        this.name = name;
    }
    // 普通方法
    /*public static Integer getIndex(String name) {
        for (ZhuShiEnum s : ZhuShiEnum.values()) {
            if (s.getName().equals(name)) {
                return s.index;
            }
        }
        return -1;
    }*/

    // 普通方法
    public static String getName(String index) {
        /*if (index==-1){
            return "";
        }*/
        for (TdlyTextEnum s : TdlyTextEnum.values()) {
            if (s.getIndex().equals(index) ) {
                return s.name;
            }
        }
        return "";
    }


    // get set 方法
    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }

    public String getIndex() {
        return index;
    }

    public void setIndex(String index) {
        this.index = index;
    }
}
